Repository: jimregan/citizens-information-raw
Catalog: en-ro/www.citizensinformation.ie/ro/moving_country/moving_to_ireland/introduction_to_the_irish_system/local_government.html.txt.tmx
Source language: en
Languages: ro

source: Political system at local level
ro: Sistemul politic la nivel local

source: Ireland has a local government system
ro: Irlanda are un sistem de guvernare local

source: Local authorities include county councils and city councils
ro: Autorităţile locale cuprind Consiliile de Comitate, Consiliile Municipale şi Consiliile Orăşeneşti

source: Since 1 June 2014, borough and town councils are replaced by a system of municipal districts, integrating town and county governance
ro: Autorităţile Locale La nivel municipal/ de comitat există 29 de Consilii de Comitate şi 5 Consilii Municipale

source: At county or city level, there are 31 city and county councils with integrated municipal districts
ro: Acestea asigură în ţară, majoritatea serviciilor guvernamentale locale

source: These are the main providers of local government services around the country
ro: În cadrul regiunii de administraţie a Consiliilor de Comitate există zonele Consiliilor Orăşeneşti

source: Local authorities at all levels are responsible for the representation of local communities and ensuring that concerns are expressed and needs met
ro: Autorităţile locale de la toate nivelele sunt responsabile pentru reprezentarea municipalităţilor locale şi pentru asigurarea exprimării preocupărilor şi îndeplinirii cerinţelor

source: Local elections are held in order to elect representatives onto the authority
ro: Pentru a alege reprezentanţi locali în administraţie, se organizează alegeri locale

source: Local representatives have the power to vote for or against developments that will impact on the local community
ro: Reprezentanţii locali au împuternicirea de a vota pentru, sau împotriva unor măsuri care influenţează comunitatea locală

source: Local authorities are also responsible for the delivery of a wide range of services in their local area
ro: • Protecţia mediului înconjurător, inclusiv a râurilor, a lacurilor, a aerului şi a zgomotului
